contiki-os/contiki/cpu/cc26xx-cc13xx/putchar.c
/*
 * Copyright (c) 2014, Texas Instruments Incorporated - http://www.ti.com/
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*---------------------------------------------------------------------------*/
#include "contiki-conf.h"
#include "cc26xx-uart.h"
#include "ti-lib.h"

#include <string.h>
/*---------------------------------------------------------------------------*/
int
putchar(int c)
{
  cc26xx_uart_write_byte(c);
  return c;
}
/*---------------------------------------------------------------------------*/
int
puts(const char *str)
{
  int i;
  if(str == NULL) {
    return 0;
  }
  size_t    len = strlen(str);
#if UART_TXBUFSIZE <= 0
  for(i = 0; i < len; i++) {
    cc26xx_uart_write_byte(str[i]);
  }
#else
  for(i = 0; i < len;) {
      unsigned sent = cc26xx_uart_write_bytes(str+i, len - i);
      /*
      if (sent == 0){
          while (!cc26xx_uart_space_avail());
      }
      else
      */
      if (sent < 0)
          return i;
      i+= sent;
  }
#endif

  cc26xx_uart_write_byte('\n');

#if UART_TXBUFSIZE <= 0
  /*
   * Wait for the line to go out. This is to prevent garbage when used between
   * UART on/off cycles
   */
  while(cc26xx_uart_busy() == UART_BUSY);
#endif

  return i;
}
/*---------------------------------------------------------------------------*/
unsigned int
dbg_send_bytes(const unsigned char *s, unsigned int len)
{
  unsigned int i = 0;

#if UART_TXBUFSIZE <= 0
  while(s && *s != 0) {
    if(i >= len) {
      break;
    }
    cc26xx_uart_write_byte(*s++);
    i++;
  }

  /*
   * Wait for the buffer to go out. This is to prevent garbage when used
   * between UART on/off cycles
   */
  while(cc26xx_uart_busy() == UART_BUSY);
#else
  for(i = 0; i < len;) {
      unsigned sent = cc26xx_uart_write_bytes(s+i, len - i);
      /*
      if (sent == 0){
          while (!cc26xx_uart_space_avail());
      }
      else
      */
      if (sent < 0)
          return i;
      i+= sent;
  }
#endif

  return i;
}
/*---------------------------------------------------------------------------*/
